tutorials/solution-time/SIPM-SP/threeCavity/noPred/caseB/system/solidR/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat	raw;
surfaceFormat     raw;

sets
(
    TatMidLine
    {
        type            uniform;
        name            cut;
        axis            x;
        start           (1 0.5 0);
        end             (1.2 0.5 0);
        nPoints         10;
    }
);

surfaces
(
    /*right
    {
        type            patch;    // always triangulated
	patchName	right;        
        interpolate     true;
        triangulate false;
    }*/

);


fields
(
	//Usolid
	T
);


// ************************************************************************* //
